7767517
236 276
Input                    in0                      0 1 in0
Convolution              conv_3                   1 1 in0 1 0=16 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=432
Swish                    silu_95                  1 1 1 2
Convolution              conv_4                   1 1 2 3 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304
Swish                    silu_96                  1 1 3 4
Convolution              conv_5                   1 1 4 5 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4608
Swish                    silu_97                  1 1 5 6
Convolution              conv_6                   1 1 6 7 0=48 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=13824
Swish                    silu_98                  1 1 7 8
Split                    splitncnn_0              1 2 8 9 10
Convolution              conv_7                   1 1 10 11 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1152
Convolution              conv_8                   1 1 9 12 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1152
Swish                    silu_100                 1 1 12 13
Split                    splitncnn_1              1 2 13 14 15
Convolution              conv_9                   1 1 15 16 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184
Swish                    silu_101                 1 1 16 17
Convolution              conv_10                  1 1 17 18 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184
Swish                    silu_102                 1 1 18 19
BinaryOp                 add_0                    2 1 14 19 20 0=0
Swish                    silu_99                  1 1 11 21
Concat                   cat_0                    2 1 21 20 22 0=0
Split                    splitncnn_2              1 2 22 23 24
Reduction                mean_170                 1 1 24 25 0=3 1=0 -23303=2,1,2 4=1 5=1
Convolution              conv_11                  1 1 25 26 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
mmcv.cnn.bricks.hsigmoid.HSigmoid activate                 1 1 26 27
BinaryOp                 mul_1                    2 1 23 27 28 0=2
Convolution              conv_12                  1 1 28 29 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3072
Swish                    silu_103                 1 1 29 30
Convolution              conv_13                  1 1 30 31 0=96 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=55296
Swish                    silu_104                 1 1 31 32
Split                    splitncnn_3              1 2 32 33 34
Convolution              conv_14                  1 1 34 35 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4608
Convolution              conv_15                  1 1 33 36 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4608
Swish                    silu_106                 1 1 36 37
Split                    splitncnn_4              1 2 37 38 39
Convolution              conv_16                  1 1 39 40 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Swish                    silu_107                 1 1 40 41
Convolution              conv_17                  1 1 41 42 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Swish                    silu_108                 1 1 42 43
BinaryOp                 add_2                    2 1 38 43 44 0=0
Split                    splitncnn_5              1 2 44 45 46
Convolution              conv_18                  1 1 46 47 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Swish                    silu_109                 1 1 47 48
Convolution              conv_19                  1 1 48 49 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Swish                    silu_110                 1 1 49 50
BinaryOp                 add_3                    2 1 45 50 51 0=0
Swish                    silu_105                 1 1 35 52
Concat                   cat_1                    2 1 52 51 53 0=0
Split                    splitncnn_6              1 2 53 54 55
Reduction                mean_171                 1 1 55 56 0=3 1=0 -23303=2,1,2 4=1 5=1
Convolution              conv_20                  1 1 56 57 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
mmcv.cnn.bricks.hsigmoid.HSigmoid pnnx_unique_0            1 1 57 58
BinaryOp                 mul_4                    2 1 54 58 59 0=2
Convolution              conv_21                  1 1 59 60 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=12288
Swish                    silu_111                 1 1 60 61
Split                    splitncnn_7              1 2 61 62 63
Convolution              conv_22                  1 1 63 64 0=192 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=221184
Swish                    silu_112                 1 1 64 65
Split                    splitncnn_8              1 2 65 66 67
Convolution              conv_23                  1 1 67 68 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=18432
Convolution              conv_24                  1 1 66 69 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=18432
Swish                    silu_114                 1 1 69 70
Split                    splitncnn_9              1 2 70 71 72
Convolution              conv_25                  1 1 72 73 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
Swish                    silu_115                 1 1 73 74
Convolution              conv_26                  1 1 74 75 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
Swish                    silu_116                 1 1 75 76
BinaryOp                 add_5                    2 1 71 76 77 0=0
Split                    splitncnn_10             1 2 77 78 79
Convolution              conv_27                  1 1 79 80 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
Swish                    silu_117                 1 1 80 81
Convolution              conv_28                  1 1 81 82 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
Swish                    silu_118                 1 1 82 83
BinaryOp                 add_6                    2 1 78 83 84 0=0
Swish                    silu_113                 1 1 68 85
Concat                   cat_2                    2 1 85 84 86 0=0
Split                    splitncnn_11             1 2 86 87 88
Reduction                mean_172                 1 1 88 89 0=3 1=0 -23303=2,1,2 4=1 5=1
Convolution              conv_29                  1 1 89 90 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864
mmcv.cnn.bricks.hsigmoid.HSigmoid pnnx_unique_1            1 1 90 91
BinaryOp                 mul_7                    2 1 87 91 92 0=2
Convolution              conv_30                  1 1 92 93 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=49152
Swish                    silu_119                 1 1 93 94
Split                    splitncnn_12             1 2 94 95 96
Convolution              conv_31                  1 1 96 97 0=384 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=884736
Swish                    silu_120                 1 1 97 98
Split                    splitncnn_13             1 2 98 99 100
Convolution              conv_32                  1 1 100 101 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=73728
Convolution              conv_33                  1 1 99 102 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=73728
Swish                    silu_122                 1 1 102 103
Split                    splitncnn_14             1 2 103 104 105
Convolution              conv_34                  1 1 105 106 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=331776
Swish                    silu_123                 1 1 106 107
Convolution              conv_35                  1 1 107 108 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=331776
Swish                    silu_124                 1 1 108 109
BinaryOp                 add_8                    2 1 104 109 110 0=0
Swish                    silu_121                 1 1 101 111
Concat                   cat_3                    2 1 111 110 112 0=0
Split                    splitncnn_15             1 2 112 113 114
Reduction                mean_173                 1 1 114 115 0=3 1=0 -23303=2,1,2 4=1 5=1
Convolution              conv_36                  1 1 115 116 0=384 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=147456
mmcv.cnn.bricks.hsigmoid.HSigmoid pnnx_unique_2            1 1 116 117
BinaryOp                 mul_9                    2 1 113 117 118 0=2
Convolution              conv_37                  1 1 118 119 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=196608
Swish                    silu_125                 1 1 119 120
Split                    splitncnn_16             1 2 120 121 122
Convolution              conv_38                  1 1 122 123 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=98304
Convolution              conv_39                  1 1 121 124 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=98304
Swish                    silu_127                 1 1 124 125
Convolution              conv_40                  1 1 125 126 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=331776
Swish                    silu_128                 1 1 126 127
Convolution              conv_41                  1 1 127 128 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=331776
Swish                    silu_129                 1 1 128 129
Split                    splitncnn_17             1 4 129 130 131 132 133
Pooling                  maxpool2d_88             1 1 131 134 0=0 1=13 11=13 12=1 13=6 2=1 3=6 5=1
Pooling                  maxpool2d_87             1 1 132 135 0=0 1=9 11=9 12=1 13=4 2=1 3=4 5=1
Pooling                  maxpool2d_86             1 1 133 136 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Concat                   cat_4                    4 1 130 136 135 134 137 0=0
Convolution              conv_42                  1 1 137 138 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=147456
Swish                    silu_130                 1 1 138 139
Swish                    silu_126                 1 1 123 140
Concat                   cat_5                    2 1 140 139 141 0=0
Convolution              conv_43                  1 1 141 142 0=384 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=147456
Swish                    silu_131                 1 1 142 143
Split                    splitncnn_18             1 2 143 144 145
Convolution              conv_44                  1 1 145 146 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=73728
Swish                    silu_132                 1 1 146 147
Interp                   upsample_162             1 1 147 148 0=1 1=2.000000e+00 2=2.000000e+00 6=0
Concat                   cat_6                    2 1 148 95 149 0=0
Split                    splitncnn_19             1 2 149 150 151
Convolution              conv_45                  1 1 151 152 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=43008
Convolution              conv_46                  1 1 150 153 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=43008
Swish                    silu_134                 1 1 153 154
Convolution              conv_47                  1 1 154 155 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
Swish                    silu_135                 1 1 155 156
Convolution              conv_48                  1 1 156 157 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
Swish                    silu_136                 1 1 157 158
Swish                    silu_133                 1 1 152 159
Concat                   cat_7                    2 1 159 158 160 0=0
Convolution              conv_49                  1 1 160 161 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864
Swish                    silu_137                 1 1 161 162
Split                    splitncnn_20             1 2 162 163 164
Convolution              conv_50                  1 1 164 165 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=18432
Swish                    silu_138                 1 1 165 166
Interp                   upsample_163             1 1 166 167 0=1 1=2.000000e+00 2=2.000000e+00 6=0
Concat                   cat_8                    2 1 167 62 168 0=0
Split                    splitncnn_21             1 2 168 169 170
Convolution              conv_51                  1 1 170 171 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=10752
Convolution              conv_52                  1 1 169 172 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=10752
Swish                    silu_140                 1 1 172 173
Convolution              conv_53                  1 1 173 174 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Swish                    silu_141                 1 1 174 175
Convolution              conv_54                  1 1 175 176 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Swish                    silu_142                 1 1 176 177
Swish                    silu_139                 1 1 171 178
Concat                   cat_9                    2 1 178 177 179 0=0
Convolution              conv_55                  1 1 179 180 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
Swish                    silu_143                 1 1 180 181
Split                    splitncnn_22             1 5 181 182 183 184 185 186
Convolution              conv_56                  1 1 186 187 0=96 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=82944
Swish                    silu_144                 1 1 187 188
Concat                   cat_10                   2 1 188 163 189 0=0
Split                    splitncnn_23             1 2 189 190 191
Convolution              conv_57                  1 1 191 192 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=27648
Convolution              conv_58                  1 1 190 193 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=27648
Swish                    silu_146                 1 1 193 194
Convolution              conv_59                  1 1 194 195 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
Swish                    silu_147                 1 1 195 196
Convolution              conv_60                  1 1 196 197 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
Swish                    silu_148                 1 1 197 198
Swish                    silu_145                 1 1 192 199
Concat                   cat_11                   2 1 199 198 200 0=0
Convolution              conv_61                  1 1 200 201 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864
Swish                    silu_149                 1 1 201 202
Split                    splitncnn_24             1 5 202 203 204 205 206 207
Convolution              conv_62                  1 1 207 208 0=192 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=331776
Swish                    silu_150                 1 1 208 209
Concat                   cat_12                   2 1 209 144 210 0=0
Split                    splitncnn_25             1 2 210 211 212
Convolution              conv_63                  1 1 212 213 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=110592
Convolution              conv_64                  1 1 211 214 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=110592
Swish                    silu_152                 1 1 214 215
Convolution              conv_65                  1 1 215 216 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=331776
Swish                    silu_153                 1 1 216 217
Convolution              conv_66                  1 1 217 218 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=331776
Swish                    silu_154                 1 1 218 219
Swish                    silu_151                 1 1 213 220
Concat                   cat_13                   2 1 220 219 221 0=0
Convolution              conv_67                  1 1 221 222 0=384 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=147456
Pooling                  gap_0                    1 1 185 223 0=1 4=1
Split                    splitncnn_26             1 2 223 224 225
Convolution              convsigmoid_0            1 1 225 226 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216 9=4
Reshape                  reshape_164              1 1 226 227 0=1 1=1 2=-1
BinaryOp                 mul_10                   2 1 182 227 228 0=2
Convolution              conv_69                  1 1 228 229 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
Swish                    silu_156                 1 1 229 230
BinaryOp                 add_11                   2 1 230 183 231 0=0
Convolution              convsigmoid_1            1 1 224 232 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216 9=4
Reshape                  reshape_165              1 1 232 233 0=1 1=1 2=-1
BinaryOp                 mul_12                   2 1 184 233 234 0=2
Convolution              conv_72                  1 1 234 235 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
Pooling                  gap_1                    1 1 206 236 0=1 4=1
Split                    splitncnn_27             1 2 236 237 238
Convolution              convsigmoid_2            1 1 238 239 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864 9=4
Reshape                  reshape_166              1 1 239 240 0=1 1=1 2=-1
BinaryOp                 mul_13                   2 1 203 240 241 0=2
Convolution              conv_75                  1 1 241 242 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864
Swish                    silu_158                 1 1 242 243
BinaryOp                 add_14                   2 1 243 204 244 0=0
Convolution              convsigmoid_3            1 1 237 245 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864 9=4
Reshape                  reshape_167              1 1 245 246 0=1 1=1 2=-1
BinaryOp                 mul_15                   2 1 205 246 247 0=2
Convolution              conv_78                  1 1 247 248 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864
Swish                    silu_155                 1 1 222 249
Split                    splitncnn_28             1 4 249 250 251 252 253
Pooling                  gap_2                    1 1 253 254 0=1 4=1
Split                    splitncnn_29             1 2 254 255 256
Convolution              convsigmoid_4            1 1 256 257 0=384 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=147456 9=4
Reshape                  reshape_168              1 1 257 258 0=1 1=1 2=-1
BinaryOp                 mul_16                   2 1 250 258 259 0=2
Convolution              conv_81                  1 1 259 260 0=384 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=147456
Swish                    silu_160                 1 1 260 261
BinaryOp                 add_17                   2 1 261 251 262 0=0
Convolution              convsigmoid_5            1 1 255 263 0=384 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=147456 9=4
Reshape                  reshape_169              1 1 263 264 0=1 1=1 2=-1
BinaryOp                 mul_18                   2 1 252 264 265 0=2
Convolution              conv_84                  1 1 265 266 0=384 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=147456
Swish                    silu_161                 1 1 266 267
Convolution              conv_85                  1 1 267 out5 0=68 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=235008
Swish                    silu_159                 1 1 248 269
Convolution              conv_79                  1 1 269 out4 0=68 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=117504
Swish                    silu_157                 1 1 235 271
Convolution              conv_73                  1 1 271 out3 0=68 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=58752
Convolution              conv_82                  1 1 262 out2 0=80 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=276480
Convolution              conv_76                  1 1 244 out1 0=80 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=138240
Convolution              conv_70                  1 1 231 out0 0=80 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=69120
