7767517
212 242
Input                    in0                      0 1 in0
mmdet.models.backbones.csp_darknet.Focus stem                     1 1 in0 1
Convolution              conv_0                   1 1 1 2 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2592
Swish                    silu_86                  1 1 2 3
Convolution              conv_1                   1 1 3 4 0=48 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=10368
Swish                    silu_87                  1 1 4 5
Split                    splitncnn_0              1 2 5 6 7
Convolution              conv_2                   1 1 7 8 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1152
Convolution              conv_3                   1 1 6 9 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1152
Swish                    silu_89                  1 1 9 10
Split                    splitncnn_1              1 2 10 11 12
Convolution              conv_4                   1 1 12 13 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=576
Swish                    silu_90                  1 1 13 14
Convolution              conv_5                   1 1 14 15 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184
Swish                    silu_91                  1 1 15 16
BinaryOp                 add_0                    2 1 16 11 17 0=0
Swish                    silu_88                  1 1 8 18
Concat                   cat_0                    2 1 17 18 19 0=0
Convolution              conv_6                   1 1 19 20 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
Swish                    silu_92                  1 1 20 21
Convolution              conv_7                   1 1 21 22 0=96 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=41472
Swish                    silu_93                  1 1 22 23
Split                    splitncnn_2              1 2 23 24 25
Convolution              conv_8                   1 1 25 26 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4608
Convolution              conv_9                   1 1 24 27 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4608
Swish                    silu_95                  1 1 27 28
Split                    splitncnn_3              1 2 28 29 30
Convolution              conv_10                  1 1 30 31 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
Swish                    silu_96                  1 1 31 32
Convolution              conv_11                  1 1 32 33 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Swish                    silu_97                  1 1 33 34
BinaryOp                 add_1                    2 1 34 29 35 0=0
Split                    splitncnn_4              1 2 35 36 37
Convolution              conv_12                  1 1 37 38 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
Swish                    silu_98                  1 1 38 39
Convolution              conv_13                  1 1 39 40 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Swish                    silu_99                  1 1 40 41
BinaryOp                 add_2                    2 1 41 36 42 0=0
Split                    splitncnn_5              1 2 42 43 44
Convolution              conv_14                  1 1 44 45 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
Swish                    silu_100                 1 1 45 46
Convolution              conv_15                  1 1 46 47 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Swish                    silu_101                 1 1 47 48
BinaryOp                 add_3                    2 1 48 43 49 0=0
Swish                    silu_94                  1 1 26 50
Concat                   cat_1                    2 1 49 50 51 0=0
Convolution              conv_16                  1 1 51 52 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
Swish                    silu_102                 1 1 52 53
Split                    splitncnn_6              1 2 53 54 55
Convolution              conv_17                  1 1 55 56 0=192 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=165888
Swish                    silu_103                 1 1 56 57
Split                    splitncnn_7              1 2 57 58 59
Convolution              conv_18                  1 1 59 60 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=18432
Convolution              conv_19                  1 1 58 61 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=18432
Swish                    silu_105                 1 1 61 62
Split                    splitncnn_8              1 2 62 63 64
Convolution              conv_20                  1 1 64 65 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
Swish                    silu_106                 1 1 65 66
Convolution              conv_21                  1 1 66 67 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
Swish                    silu_107                 1 1 67 68
BinaryOp                 add_4                    2 1 68 63 69 0=0
Split                    splitncnn_9              1 2 69 70 71
Convolution              conv_22                  1 1 71 72 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
Swish                    silu_108                 1 1 72 73
Convolution              conv_23                  1 1 73 74 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
Swish                    silu_109                 1 1 74 75
BinaryOp                 add_5                    2 1 75 70 76 0=0
Split                    splitncnn_10             1 2 76 77 78
Convolution              conv_24                  1 1 78 79 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
Swish                    silu_110                 1 1 79 80
Convolution              conv_25                  1 1 80 81 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
Swish                    silu_111                 1 1 81 82
BinaryOp                 add_6                    2 1 82 77 83 0=0
Swish                    silu_104                 1 1 60 84
Concat                   cat_2                    2 1 83 84 85 0=0
Convolution              conv_26                  1 1 85 86 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864
Swish                    silu_112                 1 1 86 87
Split                    splitncnn_11             1 2 87 88 89
Convolution              conv_27                  1 1 89 90 0=384 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=663552
Swish                    silu_113                 1 1 90 91
Convolution              conv_28                  1 1 91 92 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=73728
Swish                    silu_114                 1 1 92 93
Split                    splitncnn_12             1 4 93 94 95 96 97
Pooling                  maxpool2d_85             1 1 95 98 0=0 1=13 11=13 12=1 13=6 2=1 3=6 5=1
Pooling                  maxpool2d_84             1 1 96 99 0=0 1=9 11=9 12=1 13=4 2=1 3=4 5=1
Pooling                  maxpool2d_83             1 1 97 100 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Concat                   cat_3                    4 1 94 100 99 98 101 0=0
Convolution              conv_29                  1 1 101 102 0=384 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=294912
Swish                    silu_115                 1 1 102 103
Split                    splitncnn_13             1 2 103 104 105
Convolution              conv_30                  1 1 105 106 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=73728
Convolution              conv_31                  1 1 104 107 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=73728
Swish                    silu_117                 1 1 107 108
Convolution              conv_32                  1 1 108 109 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864
Swish                    silu_118                 1 1 109 110
Convolution              conv_33                  1 1 110 111 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=331776
Swish                    silu_119                 1 1 111 112
Swish                    silu_116                 1 1 106 113
Concat                   cat_4                    2 1 112 113 114 0=0
Convolution              conv_34                  1 1 114 115 0=384 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=147456
Swish                    silu_120                 1 1 115 116
Convolution              conv_35                  1 1 116 117 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=73728
Swish                    silu_121                 1 1 117 118
Split                    splitncnn_14             1 2 118 119 120
Interp                   upsample_160             1 1 120 121 0=1 1=2.000000e+00 2=2.000000e+00 6=0
Concat                   cat_5                    2 1 121 88 122 0=0
Split                    splitncnn_15             1 2 122 123 124
Convolution              conv_36                  1 1 124 125 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864
Convolution              conv_37                  1 1 123 126 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864
Swish                    silu_123                 1 1 126 127
Convolution              conv_38                  1 1 127 128 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
Swish                    silu_124                 1 1 128 129
Convolution              conv_39                  1 1 129 130 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
Swish                    silu_125                 1 1 130 131
Swish                    silu_122                 1 1 125 132
Concat                   cat_6                    2 1 131 132 133 0=0
Convolution              conv_40                  1 1 133 134 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864
Swish                    silu_126                 1 1 134 135
Convolution              conv_41                  1 1 135 136 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=18432
Swish                    silu_127                 1 1 136 137
Split                    splitncnn_16             1 2 137 138 139
Interp                   upsample_161             1 1 139 140 0=1 1=2.000000e+00 2=2.000000e+00 6=0
Concat                   cat_7                    2 1 140 54 141 0=0
Split                    splitncnn_17             1 2 141 142 143
Convolution              conv_42                  1 1 143 144 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
Convolution              conv_43                  1 1 142 145 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
Swish                    silu_129                 1 1 145 146
Convolution              conv_44                  1 1 146 147 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
Swish                    silu_130                 1 1 147 148
Convolution              conv_45                  1 1 148 149 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Swish                    silu_131                 1 1 149 150
Swish                    silu_128                 1 1 144 151
Concat                   cat_8                    2 1 150 151 152 0=0
Convolution              conv_46                  1 1 152 153 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
Swish                    silu_132                 1 1 153 154
Split                    splitncnn_18             1 2 154 155 156
Convolution              conv_47                  1 1 156 157 0=96 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=82944
Swish                    silu_133                 1 1 157 158
Concat                   cat_9                    2 1 158 138 159 0=0
Split                    splitncnn_19             1 2 159 160 161
Convolution              conv_48                  1 1 161 162 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=18432
Convolution              conv_49                  1 1 160 163 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=18432
Swish                    silu_135                 1 1 163 164
Convolution              conv_50                  1 1 164 165 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
Swish                    silu_136                 1 1 165 166
Convolution              conv_51                  1 1 166 167 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
Swish                    silu_137                 1 1 167 168
Swish                    silu_134                 1 1 162 169
Concat                   cat_10                   2 1 168 169 170 0=0
Convolution              conv_52                  1 1 170 171 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864
Swish                    silu_138                 1 1 171 172
Split                    splitncnn_20             1 2 172 173 174
Convolution              conv_53                  1 1 174 175 0=192 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=331776
Swish                    silu_139                 1 1 175 176
Concat                   cat_11                   2 1 176 119 177 0=0
Split                    splitncnn_21             1 2 177 178 179
Convolution              conv_54                  1 1 179 180 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=73728
Convolution              conv_55                  1 1 178 181 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=73728
Swish                    silu_141                 1 1 181 182
Convolution              conv_56                  1 1 182 183 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864
Swish                    silu_142                 1 1 183 184
Convolution              conv_57                  1 1 184 185 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=331776
Swish                    silu_143                 1 1 185 186
Swish                    silu_140                 1 1 180 187
Concat                   cat_12                   2 1 186 187 188 0=0
Convolution              conv_58                  1 1 188 189 0=384 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=147456
Convolution              conv_59                  1 1 155 190 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
Convolution              conv_60                  1 1 173 191 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=18432
Swish                    silu_144                 1 1 189 192
Convolution              conv_61                  1 1 192 193 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864
Swish                    silu_145                 1 1 190 194
Split                    splitncnn_22             1 2 194 195 196
Convolution              conv_62                  1 1 196 197 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
Swish                    silu_148                 1 1 197 198
Convolution              conv_63                  1 1 198 199 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
Convolution              conv_64                  1 1 195 200 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
Swish                    silu_150                 1 1 200 201
Convolution              conv_65                  1 1 201 202 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
Swish                    silu_146                 1 1 191 203
Split                    splitncnn_23             1 2 203 204 205
Convolution              conv_69                  1 1 205 206 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
Swish                    silu_152                 1 1 206 207
Convolution              conv_70                  1 1 207 208 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
Convolution              conv_71                  1 1 204 209 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
Swish                    silu_154                 1 1 209 210
Convolution              conv_72                  1 1 210 211 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
Swish                    silu_147                 1 1 193 212
Split                    splitncnn_24             1 2 212 213 214
Convolution              conv_76                  1 1 214 215 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
Swish                    silu_156                 1 1 215 216
Convolution              conv_77                  1 1 216 217 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
Convolution              conv_78                  1 1 213 218 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
Swish                    silu_158                 1 1 218 219
Convolution              conv_79                  1 1 219 220 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
Swish                    silu_159                 1 1 220 221
Split                    splitncnn_25             1 2 221 222 223
Convolution              conv_82                  1 1 222 out8 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=96
Convolution              conv_81                  1 1 223 out5 0=4 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=384
Swish                    silu_157                 1 1 217 226
Convolution              conv_80                  1 1 226 out2 0=80 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=7680
Swish                    silu_155                 1 1 211 228
Split                    splitncnn_26             1 2 228 229 230
Convolution              conv_75                  1 1 229 out7 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=96
Convolution              conv_74                  1 1 230 out4 0=4 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=384
Swish                    silu_153                 1 1 208 233
Convolution              conv_73                  1 1 233 out1 0=80 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=7680
Swish                    silu_151                 1 1 202 235
Split                    splitncnn_27             1 2 235 236 237
Convolution              conv_68                  1 1 236 out6 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=96
Convolution              conv_67                  1 1 237 out3 0=4 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=384
Swish                    silu_149                 1 1 199 240
Convolution              conv_66                  1 1 240 out0 0=80 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=7680
