7767517
145 177
Input                    in0                      0 1 in0
Convolution              convrelu_0               1 1 in0 1 0=64 1=7 11=7 12=1 13=2 14=3 2=1 3=2 4=3 5=1 6=9408 9=1
Pooling                  maxpool2d_0              1 1 1 2 0=0 1=3 11=3 12=2 13=1 2=2 3=1 5=1
Split                    splitncnn_0              1 2 2 3 4
Convolution              convrelu_1               1 1 4 5 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096 9=1
Convolution              convrelu_2               1 1 5 6 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=1
Convolution              conv_58                  1 1 6 7 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Convolution              conv_57                  1 1 3 8 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
BinaryOp                 add_0                    2 1 7 8 9 0=0
ReLU                     relu_5                   1 1 9 10
Split                    splitncnn_1              1 2 10 11 12
Convolution              convrelu_3               1 1 12 13 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384 9=1
Convolution              convrelu_4               1 1 13 14 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=1
Convolution              conv_61                  1 1 14 15 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
BinaryOp                 add_1                    2 1 15 11 16 0=0
ReLU                     relu_8                   1 1 16 17
Split                    splitncnn_2              1 2 17 18 19
Convolution              convrelu_5               1 1 19 20 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384 9=1
Convolution              convrelu_6               1 1 20 21 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=1
Convolution              conv_64                  1 1 21 22 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
BinaryOp                 add_2                    2 1 22 18 23 0=0
ReLU                     relu_11                  1 1 23 24
Split                    splitncnn_3              1 3 24 25 26 27
Convolution              convrelu_7               1 1 27 28 0=128 1=1 11=1 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=32768 9=1
Convolution              convrelu_8               1 1 28 29 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=1
Convolution              conv_68                  1 1 29 30 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Convolution              conv_67                  1 1 26 31 0=512 1=1 11=1 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=131072
BinaryOp                 add_3                    2 1 30 31 32 0=0
ReLU                     relu_14                  1 1 32 33
Split                    splitncnn_4              1 2 33 34 35
Convolution              convrelu_9               1 1 35 36 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536 9=1
Convolution              convrelu_10              1 1 36 37 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=1
Convolution              conv_71                  1 1 37 38 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
BinaryOp                 add_4                    2 1 38 34 39 0=0
ReLU                     relu_17                  1 1 39 40
Split                    splitncnn_5              1 2 40 41 42
Convolution              convrelu_11              1 1 42 43 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536 9=1
Convolution              convrelu_12              1 1 43 44 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=1
Convolution              conv_74                  1 1 44 45 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
BinaryOp                 add_5                    2 1 45 41 46 0=0
ReLU                     relu_20                  1 1 46 47
Split                    splitncnn_6              1 2 47 48 49
Convolution              convrelu_13              1 1 49 50 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536 9=1
Convolution              convrelu_14              1 1 50 51 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=1
Convolution              conv_77                  1 1 51 52 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
BinaryOp                 add_6                    2 1 52 48 53 0=0
ReLU                     relu_23                  1 1 53 54
Split                    splitncnn_7              1 3 54 55 56 57
Convolution              convrelu_15              1 1 57 58 0=256 1=1 11=1 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=131072 9=1
Convolution              convrelu_16              1 1 58 59 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824 9=1
Convolution              conv_81                  1 1 59 60 0=1024 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144
Convolution              conv_80                  1 1 56 61 0=1024 1=1 11=1 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=524288
BinaryOp                 add_7                    2 1 60 61 62 0=0
ReLU                     relu_26                  1 1 62 63
Split                    splitncnn_8              1 2 63 64 65
Convolution              convrelu_17              1 1 65 66 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144 9=1
Convolution              convrelu_18              1 1 66 67 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824 9=1
Convolution              conv_84                  1 1 67 68 0=1024 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144
BinaryOp                 add_8                    2 1 68 64 69 0=0
ReLU                     relu_29                  1 1 69 70
Split                    splitncnn_9              1 2 70 71 72
Convolution              convrelu_19              1 1 72 73 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144 9=1
Convolution              convrelu_20              1 1 73 74 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824 9=1
Convolution              conv_87                  1 1 74 75 0=1024 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144
BinaryOp                 add_9                    2 1 75 71 76 0=0
ReLU                     relu_32                  1 1 76 77
Split                    splitncnn_10             1 2 77 78 79
Convolution              convrelu_21              1 1 79 80 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144 9=1
Convolution              convrelu_22              1 1 80 81 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824 9=1
Convolution              conv_90                  1 1 81 82 0=1024 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144
BinaryOp                 add_10                   2 1 82 78 83 0=0
ReLU                     relu_35                  1 1 83 84
Split                    splitncnn_11             1 2 84 85 86
Convolution              convrelu_23              1 1 86 87 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144 9=1
Convolution              convrelu_24              1 1 87 88 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824 9=1
Convolution              conv_93                  1 1 88 89 0=1024 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144
BinaryOp                 add_11                   2 1 89 85 90 0=0
ReLU                     relu_38                  1 1 90 91
Split                    splitncnn_12             1 2 91 92 93
Convolution              convrelu_25              1 1 93 94 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144 9=1
Convolution              convrelu_26              1 1 94 95 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824 9=1
Convolution              conv_96                  1 1 95 96 0=1024 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144
BinaryOp                 add_12                   2 1 96 92 97 0=0
ReLU                     relu_41                  1 1 97 98
Split                    splitncnn_13             1 3 98 99 100 101
Convolution              convrelu_27              1 1 101 102 0=512 1=1 11=1 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=524288 9=1
Convolution              convrelu_28              1 1 102 103 0=512 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2359296 9=1
Convolution              conv_100                 1 1 103 104 0=2048 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1048576
Convolution              conv_99                  1 1 100 105 0=2048 1=1 11=1 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=2097152
BinaryOp                 add_13                   2 1 104 105 106 0=0
ReLU                     relu_44                  1 1 106 107
Split                    splitncnn_14             1 2 107 108 109
Convolution              convrelu_29              1 1 109 110 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1048576 9=1
Convolution              convrelu_30              1 1 110 111 0=512 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2359296 9=1
Convolution              conv_103                 1 1 111 112 0=2048 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1048576
BinaryOp                 add_14                   2 1 112 108 113 0=0
ReLU                     relu_47                  1 1 113 114
Split                    splitncnn_15             1 2 114 115 116
Convolution              convrelu_31              1 1 116 117 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1048576 9=1
Convolution              convrelu_32              1 1 117 118 0=512 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2359296 9=1
Convolution              conv_106                 1 1 118 119 0=2048 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1048576
BinaryOp                 add_15                   2 1 119 115 120 0=0
ReLU                     relu_50                  1 1 120 121
Convolution              conv_107                 1 1 121 122 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288
Split                    splitncnn_16             1 2 122 123 124
Interp                   upsample_nearest_51      1 1 123 125 0=1 1=2.000000e+00 2=2.000000e+00 6=0
Convolution              conv_108                 1 1 99 126 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144
BinaryOp                 add_16                   2 1 126 125 127 0=0
Split                    splitncnn_17             1 2 127 128 129
Interp                   upsample_nearest_52      1 1 128 130 0=1 1=2.000000e+00 2=2.000000e+00 6=0
Convolution              conv_109                 1 1 55 131 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
BinaryOp                 add_17                   2 1 131 130 132 0=0
Split                    splitncnn_18             1 2 132 133 134
Interp                   upsample_nearest_53      1 1 133 135 0=1 1=2.000000e+00 2=2.000000e+00 6=0
Convolution              conv_110                 1 1 25 136 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
BinaryOp                 add_18                   2 1 136 135 137 0=0
Convolution              conv_112                 1 1 137 138 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
Split                    splitncnn_19             1 2 138 out10 140
Convolution              conv_116                 1 1 134 141 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
Split                    splitncnn_20             1 2 141 out11 143
Convolution              conv_120                 1 1 129 144 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
Split                    splitncnn_21             1 2 144 out12 146
Convolution              conv_111                 1 1 124 147 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
Split                    splitncnn_22             1 3 147 out13 149 150
Pooling                  maxpool2d_1              1 1 149 151 0=0 1=1 11=1 12=2 13=0 2=2 3=0 5=1
Convolution              convrelu_33              1 1 151 152 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824 9=1
Split                    splitncnn_23             1 2 152 153 154
Convolution              conv_129                 1 1 153 out9 0=12 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3072
Convolution              conv_128                 1 1 154 out4 0=3 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=768
Convolution              convrelu_34              1 1 150 157 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824 9=1
Split                    splitncnn_24             1 2 157 158 159
Convolution              conv_126                 1 1 158 out8 0=12 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3072
Convolution              conv_125                 1 1 159 out3 0=3 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=768
Convolution              convrelu_35              1 1 146 162 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824 9=1
Split                    splitncnn_25             1 2 162 163 164
Convolution              conv_123                 1 1 163 out7 0=12 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3072
Convolution              conv_122                 1 1 164 out2 0=3 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=768
Convolution              convrelu_36              1 1 143 167 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824 9=1
Split                    splitncnn_26             1 2 167 168 169
Convolution              conv_119                 1 1 168 out6 0=12 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3072
Convolution              conv_118                 1 1 169 out1 0=3 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=768
Convolution              convrelu_37              1 1 140 172 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824 9=1
Split                    splitncnn_27             1 2 172 173 174
Convolution              conv_115                 1 1 173 out5 0=12 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3072
Convolution              conv_114                 1 1 174 out0 0=3 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=768
